## Numpy. 
### Задание 1

In [31]:
import numpy as np

In [32]:
a = np.array([[1, 6],
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])

In [33]:
mean_a = a.mean(axis=0)

In [34]:
mean_a

array([2. , 8.4])

### Задание 2

In [35]:
a_centered = a - mean_a

In [36]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

### Задание 3

In [37]:
a_centered_sp = a_centered[:, 0].dot(a_centered[:, 1]) / (a_centered.shape[0] - 1)

In [38]:
a_centered_sp

2.0

### Задание 4

In [39]:
a_np_cov = np.cov(a.T)

In [40]:
a_np_cov[0, 1]

2.0

## Pandas. 
### Задание 1

In [41]:
import pandas as pd

In [42]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']})

In [43]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                      'book_title ': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий',
                                      'Дама с собачкой',
                                      'Гроза', 'Таланты и поклонники'],
                      'price': [450, 300, 350, 500, 450, 370, 290]})

In [44]:
books

   author_id           book_title   price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [45]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [46]:
authors_price

   author_id author_name           book_title   price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [47]:
top5 = authors_price.sort_values('price', ascending=False).head(5)
top5.reset_index(drop=True, inplace=True)

In [48]:
top5

   author_id author_name        book_title   price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

### Задание 4

In [49]:
authors_stat = pd.DataFrame({'min_price': top5.groupby('author_name')['price'].min(),
                             'max_price': top5.groupby('author_name')['price'].max(),
                             'mean_price': top5.groupby('author_name')['price'].mean()})

In [50]:
authors_stat

             min_price  max_price  mean_price
author_name
Островский         370        370         370
Тургенев           350        450         400
Чехов              450        500         475

### Задание 5

In [51]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
book_info = pd.pivot_table(authors_price,
                           index='author_name',
                           columns='cover',
                           values='price',
                           aggfunc=[np.sum],
                           fill_value=0)

In [52]:
book_info

               sum
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950

In [53]:
book_info.to_pickle('book_info.pkl')
book_info2 = pd.read_pickle('book_info.pkl')

In [54]:
book_info2

               sum
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950